# DBDiagnose

## Description
Tests ODBC connectivity and creates log file in application folder. Returns true if succeeded.

First it opens a dialog "Database Connection" dialog. Choose a data source from the popup.

```pascal
FUNCTION DBDiagnose : BOOLEAN;
```

```python
def vs.DBDiagnose():
    return BOOLEAN
```

## Examples
#### VectorScript ####
```pascal
PROCEDURE Test;
VAR
	isOK : BOOLEAN;
BEGIN
	isOK := DBDiagnose;
END;

Run(Test);
```
#### Python ####
```python
import vs
def Test():
	vs.DBDiagnose()

Test()
```

```pascal
resultOK := DBDiagnose;
```
```python
import vs

# Tests ODBC connectivity and creates log file in application folder.
ok = vs.DBDiagnose()
if ok:
    vs.Message('DBDiagnose succeeded')
else:
    vs.Message('DBDiagnose failed')
```

## Version
Availability: from Vectorworks 2015

## Category
* ODBC